<a href="https://colab.research.google.com/github/herysedra/covid19-mankaiza-clone/blob/andrana/stats/Fampita_mdg_ke.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [17]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [0]:
!pip install pingouin

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import scipy.stats
import matplotlib
import pickle

import pymc3 as pm
import theano.tensor as tt
import theano
import datetime
import time
import pingouin 

#from pingouin import corr
import pandas.util.testing as tm

cco_cases_mdg = pd.read_csv("/content/drive/My Drive/data/cco mdg.csv")

tilyvoa = pd.read_csv("/content/drive/My Drive/data/tilyvoa.csv")

Kenyans_data = pd.read_csv("/content/drive/My Drive/data/Kenyans data.csv")

mdg_databe = pd.read_csv("/content/drive/My Drive/data/databe mdg.csv")


cco_cases_mdg.set_index('Date', inplace=True)

tilyvoa.set_index('Daty', inplace=True)



path_to_save = '/content/drive/My Drive/sary/'
path_data = '/content/drive/My Drive/data/'

In [19]:
mdg_databe.info()
mdg_databe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 171 entries, 0 to 170
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   0 non-null      float64
 1   Unnamed: 1   171 non-null    object
 2   Unnamed: 2   119 non-null    object
 3   Unnamed: 3   116 non-null    object
 4   Unnamed: 4   171 non-null    object
 5   Unnamed: 5   48 non-null     object
 6   Unnamed: 6   74 non-null     object
 7   Unnamed: 7   111 non-null    object
 8   Unnamed: 8   45 non-null     object
 9   Unnamed: 9   38 non-null     object
 10  Unnamed: 10  171 non-null    object
dtypes: float64(1), object(10)
memory usage: 14.8+ KB

     Unnamed: 0 Unnamed: 1 Unnamed: 2  ... Unnamed: 8 Unnamed: 9  Unnamed: 10
0           NaN   Loharano       Lnav  ...     Avaiza   Fiaviana  Voa sa tsia
1           NaN     FB-TVM       lahy  ...        NaN        NaN            1
2           NaN     FB-TVM       lahy  ...        NaN        NaN            1
3           NaN     FB-TVM       vavy  ...        NaN        NaN            1
4           NaN     FB-TVM       vavy  ...        NaN        NaN            1
..          ...        ...        ...  ...        ...        ...          ...
166         NaN     FB-TVM       lahy  ...     sidina   malagasy            1
167         NaN     FB-TVM       lahy  ...     sidina     vahiny            1
168         NaN     FB-TVM       lahy  ...     sidina   malagasy            1
169         NaN     FB-TVM       vavy  ...     sidina   malagasy            1
170         NaN     FB-TVM        NaN  ...        NaN        NaN            0

[171 rows x 11 columns]

In [0]:
Kenyans_data.info()
Kenyans_data

In [0]:
 df = pd.DataFrame([('bird', 'Falconiformes', 389.0),
                      ('bird', 'Psittaciformes', 24.0),
                       ('mammal', 'Carnivora', 80.2),
                       ('mammal', 'Primates', np.nan),
                       ('mammal', 'Carnivora', 58)],
                       index=['falcon', 'parrot', 'lion', 'monkey', 'leopard'],
                      columns=('class', 'order', 'max_speed'))
df

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [0]:
grouped = df.groupby('class')
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f2cb21aa668>

In [0]:
grouped = df.groupby('order', axis='columns')
grouped

In [0]:
grouped = df.groupby(['class', 'order'])
grouped